a,b,c,d,e,f,g,h = range(8)

#邻接(邻居)列表

N = [
    [b,c,d,e,f],#a
    [c,e],
    [d],
    [e],
    [f],
    [c,g,h],
    [f,h],
    [f,g]
]



#加权邻接字典 (与其邻居结点 边 的权重)
a,b,c,d,e,f,g,h = range(8)

N = [
    {b:2,c:1,d:3,e:9,f:4},#a
    {c:4,e:3},
    {d:8},
    {e:7},
    {f:5},
    {c:2,g:2,h:2},
    {f:1,h:6},
    {f:9,g:8}
]
b in N[a] # True
len(N[f]) #3
N[a][b] #2


# 邻接集的字典表示法
N = {
    'a':set('bcdef'),
    'b':set('ce'),
    'c':set('d'),
    'd':set('e'),
    'e':set('f'),
    'f':set('cgh'),
    'g':set('fh'),
    'h':set('fg')
}

#邻接矩阵(嵌套list)
a,b,c,d,e,f,g,h = range(8)
        #a b c d e f g h
N = [
        [0,1,1,1,1,1,0,0], #a
        [0,0,1,0,1,0,0,0], #b
        [0,0,0,1,0,0,0,0],
        [0,0,0,0,1,0,0,0],
        [0,0,0,0,0,1,0,0],
        [0,0,1,0,0,0,1,1],
        [0,0,0,0,0,1,0,1],
        [0,0,0,0,0,1,1,0]
]


